## 📋 OpenTofu Plan

**Environment:** `dev`
**Directory:** `./environments/dev`

<details>
<summary>Show Plan Output</summary>

```hcl
Acquiring state lock. This may take a few moments...
data.azurerm_management_group.tenant_root: Reading...
data.azurerm_management_group.tenant_root: Read complete after 0s [id=/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e]
module.drive_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01]
module.sandbox_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-sandbox-dev-glb-01]
module.management_management_group.azurerm_management_group.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01]
module.policy_deny_delete.azurerm_policy_definition.deny_delete: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/90d27970-b92c-43dc-9935-1ed557d8e20e/providers/Microsoft.Authorization/policyDefinitions/deny-delete-deny-delete]
module.management_subscription_association.azurerm_management_group_subscription_association.this: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c]
azurerm_management_group_policy_assignment.drive_deny_delete: Refreshing state... [id=/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01/providers/Microsoft.Authorization/policyAssignments/deny-del-drive]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.management_management_group.azurerm_management_group.this has changed
  ~ resource "azurerm_management_group" "this" {
        id                         = "/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01"
        name                       = "mg-management-prd-glb-01"
      ~ subscription_ids           = [
          + "9312c5c5-b089-4b62-bb90-0d92d421d66c",
        ]
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

OpenTofu will perform the following actions:

  # azurerm_management_group_policy_assignment.drive_deny_delete must be replaced
-/+ resource "azurerm_management_group_policy_assignment" "drive_deny_delete" {
      ~ id                   = "/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01/providers/Microsoft.Authorization/policyAssignments/deny-del-drive" -> (known after apply)
      ~ management_group_id  = "/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01" # forces replacement -> (known after apply) # forces replacement
      ~ metadata             = jsonencode(
            {
              - createdBy = "c12d9d4e-39e5-4621-8fe9-578e3915b2ee"
              - createdOn = "2025-12-28T17:37:08.4990018Z"
              - updatedBy = null
              - updatedOn = null
            }
        ) -> (known after apply)
        name                 = "deny-del-drive"
      - not_scopes           = [] -> null
        # (4 unchanged attributes hidden)
    }

  # module.drive_management_group.azurerm_management_group.this must be replaced
-/+ resource "azurerm_management_group" "this" {
      ~ id                         = "/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01" -> (known after apply)
      ~ name                       = "mg-drive-prd-glb-01" -> "mg-drive-dev-glb-01" # forces replacement
      ~ subscription_ids           = [] -> (known after apply)
      ~ tenant_scoped_id           = "/tenants/90d27970-b92c-43dc-9935-1ed557d8e20e/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.drive_subscription.azurerm_management_group_subscription_association.this will be created
  + resource "azurerm_management_group_subscription_association" "this" {
      + id                  = (known after apply)
      + management_group_id = (known after apply)
      + subscription_id     = (known after apply)
    }

  # module.drive_subscription.azurerm_subscription.this will be created
  + resource "azurerm_subscription" "this" {
      + alias             = "sub-drive-dev-gwc-01"
      + billing_scope_id  = "/providers/Microsoft.Billing/billingAccounts/ffbe90e4-4c92-51f3-62db-7a172bf13a15:6bd78d7c-050e-43d3-b328-5b78d77bd526_2019-05-31/billingProfiles/DYXR-KFLN-BG7-PGB/invoiceSections/VD3P-IQFM-PJA-PGB"
      + id                = (known after apply)
      + subscription_id   = (known after apply)
      + subscription_name = "sub-drive-dev-gwc-01"
      + tags              = {
          + "cost_center" = "infra"
          + "owner"       = "kvdb"
        }
      + tenant_id         = (known after apply)
    }

  # module.management_management_group.azurerm_management_group.this must be replaced
-/+ resource "azurerm_management_group" "this" {
      ~ id                         = "/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01" -> (known after apply)
      ~ name                       = "mg-management-prd-glb-01" -> "mg-management-dev-glb-01" # forces replacement
      ~ subscription_ids           = [
          - "9312c5c5-b089-4b62-bb90-0d92d421d66c",
        ] -> (known after apply)
      ~ tenant_scoped_id           = "/tenants/90d27970-b92c-43dc-9935-1ed557d8e20e/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.management_subscription_association.azurerm_management_group_subscription_association.this must be replaced
-/+ resource "azurerm_management_group_subscription_association" "this" {
      ~ id                  = "/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c" -> (known after apply)
      ~ management_group_id = "/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 6 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ drive_management_group              = {
      ~ id           = "/providers/Microsoft.Management/managementGroups/mg-drive-prd-glb-01" -> (known after apply)
      ~ name         = "mg-drive-prd-glb-01" -> "mg-drive-dev-glb-01"
        # (1 unchanged attribute hidden)
    }
  ~ management_management_group         = {
      ~ id           = "/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01" -> (known after apply)
      ~ name         = "mg-management-prd-glb-01" -> "mg-management-dev-glb-01"
        # (1 unchanged attribute hidden)
    }
  ~ management_subscription_association = {
      ~ id                  = "/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01/subscriptions/9312c5c5-b089-4b62-bb90-0d92d421d66c" -> (known after apply)
      ~ management_group_id = "/providers/Microsoft.Management/managementGroups/mg-management-prd-glb-01" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/_temp/tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "/home/runner/work/_temp/tfplan"
Releasing state lock. This may take a few moments...
```

</details>

*Triggered by @KrijnvanderBurg in commit 6df008279dcf56f5ca0b18143869c751454ee73e*